# Segmentación de público objetivo: clustering

Para ayudar a las startups a elegir dónde colocar su publicidad, realizaremos una segmentación de su público objetivo.

Supongamos que tenemos datos sobre los clientes que han manifestado interés en cierta startup (obtenidos de una encuesta, por ejemplo). Se trata de definir varios segmentos (clusters) para ayudar a dicha startup a decidir hacia qué grupos de clientes enfocar su publicidad.

## Importación de librerías

In [5]:
import os
import pandas as pd

## Importación de datos

Utilizaremos el dataset *hobbies* encontrado en la librería de R *FactoMineR*. Este dataset contiene intereses y características demográficas (edad, profesión, género).

In [3]:
current_path = os.getcwd() #obtener la ruta donde se guarda este cuaderno
dataset_path =current_path+'/clients_profile.csv' #obtener la ruta donde se guarda el conjunto de datos de los clientes

In [6]:
clients_df=pd.read_csv(dataset_path, na_values=['none','None'])

In [7]:
clients_df.head()

,Unnamed: 0,Reading,Listening music,Cinema,Show,Exhibition,Computer,Sport,Walking,Travelling,...,Gardening,Knitting,Cooking,Fishing,TV,Sex,Age,Marital status,Profession,nb.activitees
0,11000210,1,1,1,1,1,0,1,1,1,...,0,0,0,0,2,F,"(55,65]",Married,Management,11
1,11000410,1,0,0,0,1,0,1,1,0,...,1,0,0,0,4,M,"(45,55]",Married,NaN,9
2,11000610,1,1,0,0,1,0,0,0,1,...,0,0,0,0,4,F,"(25,35]",Remarried,Management,5
3,11000710,1,0,0,0,1,0,1,0,1,...,0,0,0,0,1,M,"(75,85]",Married,NaN,5
4,11000810,1,1,1,1,0,0,0,1,0,...,0,0,0,0,3,M,"(55,65]",Married,Employee,6